Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/social_welfare_payments_to_families_and_children/maternity_benefit.html.txt.tmx
Source language: en
Languages: ga

source: If she got Illness Benefit she would get €380.70 (this is the personal rate of Illness Benefit + an Increase for a Qualified Adult + Increases for 2 Qualified Children)
ga: Dá bhfaigheadh sí Sochar Breoiteachta gheobhadh sí €380.70 (is é sin an ráta pearsanta de Shochar Breoiteachta + Méadú do Dhuine Fásta Cáilithe + Méadú do Leanaí Cáilithe)

source: She cannot get less Maternity Benefit than she would get if ill and getting Illness Benefit
ga: Ní féidir léi níos lú Sochar Máithreachais a fháil ná an méid a gheobhadh sí dá mbeadh sí tinn agus Sochar Breoiteachta á fháil aici

source: For this reason, she will get Maternity Benefit of €380.70
ga: Gheobhaidh sí €380.70 de Shochar Máithreachais ar an gcúis sin

source: If your adult dependant is getting a social welfare payment you will not get an Increase for a Qualified Adult (IQA) but you may get a half-rate Increase for a Qualified Child (IQC)
ga: Má tá do chleithiúnaí aosaithe ag fáil íocaíochta leasa shóisialaigh ní bhfaighidh tú Méadú do Dhuine Fásta Cáilithe (MDFC) ach féadfaidh tú Méadú do Leanbh Cáilithe (MLC) ar leathráta a fháil

source: You will qualify for a full-rate IQA and a full-rate IQC, if your adult dependant is unemployed and signing on for credits or is earning under €100.01 per week
ga: Beidh tú incháilithe do MDFC ag an ráta iomlán agus MLC ag an ráta iomlán, má tá do chleithiúnaí aosaithe dífhostaithe agus ag saighneáil i gcomhair creidmheasanna nó ag tuilleamh níos lú ná €100.01 sa tseachtain

source: If your adult dependant is earning between €100.01 and €310 per week you will get a tapered rate of IQA and a full-rate IQC
ga: Má tá do chleithiúnaí aosaithe ag tuilleamh idir €100.01 agus €310 sa tseachtain gheobhaidh tú MDFC ag ráta laghdaithe agus MLC ag an ráta iomlán

source: If your adult dependant is earning between €310.01 and €400 per week you will not get an IQA but you will get half rate IQC
ga: Má tá do chleithiúnaí aosaithe ag tuilleamh idir €310.01 agus €400 sa tseachtain ní bhfaighidh tú MDFC ach gheobhaidh tú MLC ag leathráta

source: If your adult dependant earns over €400 per week you will not get an IQA or IQC
ga: Má thuilleann do chleithiúnaí aosaithe os cionn €400.00 sa tseachtain ní bhfaighidh tú MDFC ná MLC

source: You should apply 6 weeks before you intend to go on maternity leave. If you are self-employed, you should apply at least 12 weeks before you intend to go on maternity leave
ga: Is féidir leat an fhoirm MB1 (foirm pdf) a chomhlánú 6 seachtainí roimh an dáta a bhfuil sé i gceist agat dul ar shaoire mháithreachais agus seol chuig an Rannóg Shochair Mháithreachais í

source: Self-employed people: If you are self-employed, a doctor must certify the due date of your baby. This is required to confirm that you are entitled to maternity leave
ga: Má tá tú féinfhostaithe, ba cheart duit iarratas a dhéanamh ar a laghad 12 seachtainí roimh é a bheith i gceist agat dul ar Shaoire Mháithreachais

source: This is form MB3: Medical Certificate for Maternity Benefit (pdf)
ga: Tá an fhoirm seo ar fáil tríd an bpost ag an seoladh thíos

source: You can apply for Maternity Benefit online at mywelfare.ie
ga: Féadfaidh tú iarratas a dhéanamh ar Shochar Máithreachais ar líne ag mywelfare.ie

source: You upload your application form and supporting documentation (form MB2 for employees or form MB3 if you're self-employed) and submit them online
ga: Déanann tú do cháipéisíocht tacaíochta a uaslódáil agus seolann tú ar aghaidh í le d’iarratas

source: You must have a Public Services Card (linked to your mobile phone number) and a verified MyGovID account to apply online
ga: Caithfidh Cárta Seirbhísí Poiblí a bheith agat chun iarratas a dhéanamh ar Shochar Máithreachais

source: If you do not already have a Public Services Card, you can make an appointment to get one at mywelfare.ie
ga: Mura bhfuil Cárta Seirbhísí Poiblí agat cheana féin, féadfaidh tú coinne a dhéanamh chun ceann a fháil ag mywelfare.ie

source: You will first need to register with the site
ga: Beidh ort clárú leis an láithreán ar dtús

source: To do this you need a mobile phone number and 2 e-mail addresses (a main address and an alternate address)
ga: Chun seo a dhéanamh, teastaíonn uimhir ghuthán póca agus dhá sheoladh ríomhphoist uait (príomhsheoaldh ríomhphoist agus seoladh eile ríomhphoist)

source: When you have made your appointment, print the notification and bring it to your appointment along with the required documents (listed in the notification)
ga: Nuair a bheidh do choinne déanta, priontáil an fógra agus tabhair leat é chuig do choinne anuas ar na cáipéisí a theastaíonn (a liostaítear san fhógra)

source: You can email the Maternity Benefit section using the secure enquiry form
ga: Is féidir leat ríomhphost a chur chuig Rannóg an tSochair Mháithreachais agus úsáid á baint as foirm fhiosrúcháin shlán maidir le Sochar Máithreachais
